---
type: StructuralSectionGeneralI
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 7
tags: [revit-api, class]
---

# StructuralSectionGeneralI

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionGeneralI | 2018 | `public StructuralSectionGeneralI ( double width , double height , double flangeThickness , double flangeThicknessLocation , double flangeFillet , double flangeToeOfFillet , double slopedFlangeAngle , double webThickness ` |
| Method | GetFlangeThicknessInFlangeCenter | 2018 | `public double GetFlangeThicknessInFlangeCenter ()` |
| Method | GetFlangeThicknessInQuarterWidth | 2018 | `public double GetFlangeThicknessInQuarterWidth ()` |
| Property | FlangeFillet | 2018 | `public double FlangeFillet { get ; set ; }` |
| Property | FlangeToeOfFillet | 2018 | `public double FlangeToeOfFillet { get ; set ; }` |
| Property | SlopedFlangeAngle | 2018 | `public double SlopedFlangeAngle { get ; set ; }` |
| Property | WebToeOfFillet | 2018 | `public double WebToeOfFillet { get ; set ; }` |